insert into subject(name, teacher)
values ('Аналітичні сховища даних', 'Кривенчук Ю.П.'),
       ('Функційне програмування', 'Соколовський І.Я.'),
       ('Функційне програмування', 'Барна А.О.'),
       ('Машинне навчання', 'Бойчук А.Р.'),
       ('Машинне навчання', 'Гурбич'),
       ('Технології розподілених систем та паралельних обчислень', 'Мочурад Л.Я.'),
       ('Комп`ютерна графіка', 'Гайдучок О.В.');

insert into schedule(subject_id, day, hour)
values (1, 'Tue', '8:30'),
       (4, 'Tue', '10:20'),
       (1, 'Tue', '14:15'),
       (2, 'Tue', '14:15'),
       (5, 'Tue', '16:00');

insert into schedule(subject_id, day, hour)
values (6, 'Fri', '12:10'),
       (7, 'Fri', '12:10'),
       (7, 'Fri', '14:15'),
       (6, 'Fri', '14:15'),
       (3, 'Fri', '16:00');
